// Завдання 1

// 1. Створіть клас "Книга" (Book) з властивостями, такими як "назва", "автор" і "рік видання". Додайте метод до класу Book, який буде виводити повний опис книги наприклад printInfo. Створіть кілька об'єктів цього класу та викличте printInfo для кожного екземпляру.
// 2. В окремому файлі створіть клас "Електронна книга" (EBook), який буде успадковувати властивості та методи класу Book. Додайте до класу EBook нову властивість, наприклад, "формат файлу". Сторіть метод printInfo для EBook таким чином щоб друкувалась вся доступна інформація про екземляр EBook (все те саме що і для Book але ще формат файлу). Створіть інстанс (екземпляр) класу EBook та викличте метод printInfo
// 3. Геттери та сеттери: Додайте геттери та сеттери для всіх властивостей класу Book та EBook. В сеттерах необхідно додати валідацію для переданих значень. Використовуйте їх для зміни та отримання значень властивостей.
// 4. Створіть статичний метод в класі Book, який буде приймати масив об'єктів(екземрлярів) книг та повертати найдавнішу книгу за роком видання. Викличте його в коді передавши масив книг (серед них мають бути екземляри обох класів Book та EBook)
// 5. Створіть статичний метод для EBook який буде приймати як аргументи екземпляр класу Book і формат файлу як рядок ****та повертати екземпляр класу EBook

import { Book } from "./Book.js";
import { EBook } from "./EBook.js";

const book1 = new Book("Jhon", "Author Jhon", 1999);
const book2 = new Book("Tom", "Author Tom", 1998);
const bookE = new EBook("Mac", "Author Mac", 2000, ".pdf");

book1.printInfo();
book2.printInfo();
bookE.printInfo();

const books = [book1, book2, bookE];
const oldestBook = Book.getOldestBookAndEBook(books);
console.log("The oldest book is:");
oldestBook.printInfo();

const newEBook = EBook.createEBookFromBook(book1, ".txt");
newEBook.printInfo();
