// Завдання 5: Об'єднання масивів

// Вам потрібно створити програму, яка об'єднає два масиви в один

// Ось кроки, які вам потрібно виконати:

// Створіть два масиви, наприклад, firstArray і secondArray, які містять деякі значення.
// Створіть новий масив, який містить всі елементи з обох вихідних масивів.
// Виведіть отриманий об'єднаний масив на консоль.

const firstArray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
const secondArray = [11, 12, 13, 14, 15, 16, 17, 18, 19, 20];
const concatArray = firstArray.concat(secondArray);

console.log(concatArray);
